Catalogs/МетодыРасчетаОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>МетодыРасчетаОтпуска</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеполныеМесяцы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НеполныеМесяцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоРабочимДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МетодыРасчетаОтпуска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.МетодыРасчетаОтпуска;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Наименование);
		НеполныеМесяцы = СокрЛП(СтрокаТаблицыЗначений.НеполныеМесяцы);
		ВидРасчета = СокрЛП(СтрокаТаблицыЗначений.ВидРасчета);
		ВидОтпуска = СокрЛП(СтрокаТаблицыЗначений.ВидОтпуска);
		КоэффициентРасчета = СокрЛП(СтрокаТаблицыЗначений.КоэффициентРасчета);
		РасчетПоРабочимДням = СокрЛП(СтрокаТаблицыЗначений.РасчетПоРабочимДням);
		
		СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(Наименование, Истина);
		
		Если СправочникСсылка.Пустая() Тогда
			СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;	
		
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.НеполныеМесяцы = Перечисления.НеполныеМесяцы[НеполныеМесяцы];
		СправочникОбъект.ВидРасчета = ПланыВидовРасчета.ВидыНачислений.НайтиПоНаименованию(ВидРасчета, Истина);
		СправочникОбъект.ВидОтпуска = Перечисления.ВидыОтпусков[ВидОтпуска];
		СправочникОбъект.КоэффициентРасчета = КоэффициентРасчета;
		СправочникОбъект.РасчетПоРабочимДням = ?(ВРег(РасчетПоРабочимДням) = "ДА", Истина, Ложь);
		
		БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
